package by.tr.home.linear_program;

/*Написать программу, которая выводит на экран первые четыре степени числа π*/

public class Task15 {

	public static void main(String[] args) {

		System.out.println(Math.pow(Math.PI, 1));
		System.out.println(Math.pow(Math.PI, 2));
		System.out.println(Math.pow(Math.PI, 3));
		System.out.println(Math.pow(Math.PI, 4));

	}

}
